const statusMapping = {
    1: "Нове замовлення",
    2: "Комплектується. Дані підтверджені",
    3: "Передано в службу доставки",
    4: "Доставляється",
    5: "Чекає в пункті самовивозу",
    6: "Замовлення виконано",
    7: "Не оброблено продавцем протягом дня",
    11: "Не прийшов за замовленням",
    12: "Відмова при отриманні",
    13: "Скасовано Адміністратором",
    15: "Некоректний ТТН",
    16: "Немає в наявності / брак",
    17: "Не влаштовують умови оплати",
    18: "Не вдалося зв'язатися",
    19: "Замовлення повернено",
    20: "Товар не підходить за характеристиками",
    24: "Скасування. Не влаштовує доставка",
    25: "Тестове замовлення",
    26: "Опрацьовується менеджером",
    27: "Вимагає доукомплектації",
    28: "Неправильні контактні дані",
    29: "Ціна змінилася",
    30: "Закінчився термін резерву",
    31: "Скасування. Створено дублююче замовлення",
    33: "Умови доставки не влаштовують",
    37: "Передоплата не влаштовує",
    38: "Не влаштовує товар",
    40: "Клієнт передумав",
    42: "Немає в наявності",
    43: "Брак",
    44: "Скасування. Фейкове замовлення",
    45: "Скасовано покупцем",
    46: "Відновлено при продзвоні",
    47: "Планується повторний дзвінок",
    49: "Повторне замовлення",
    50: "Клієнт не оплатив",
    51: "У кредиті відмовлено",
    52: "Нове замовлення за 1 клік",
    53: "Очікує підтвердження клієнтом",
    54: "Опрацьовано автоматично",
    55: "Очікує отримання оплати",
    56: "Комплектується перевізником",
    57: "Заплановано доставку",
    58: "Передано до служби доставки в Польщі",
    59: "На митному контролі",
    60: "Передано до служби доставки в Україні",
    61: "Заплановано передачу перевізникові",
    62: "Змінено дату видачі",
    63: "Обробляється службою доставки",
    64: "Доставляється в місто отримувача",
    65: "Перебуває в місті отримувача",
    66: "Перебуває в місті отримувача",
    67: "Видано кур'єру в місті отримувача",
    68: "Отримано частково",
    69: "Змінено дату чи адресу доставки",
    70: "Планується повторний дзвінок (old)",
    71: "Скасування. Товар повернувся",
    72: "Скасування. Здійснено повернення коштів",
    73: "У черзі на отримання",
    74: "Сьогодні закінчується термін резерву",
    75: "Скасування. Скасовано КЦ",
    76: "Очікує клієнта у почтоматі",
    77: "Скасування. Відмовлено банком",
    78: "Змінено час видачі",
    79: "Очікує модерації КЦ",
    80: "Чекає на отримання від Продавця",
    81: "Прийнятий від Продавця",
    82: "Знаходиться у РЦ",
    83: "Буде повернено відправнику",
    84: "Знаходиться у точці для повернення",
    85: "Повернено продавцю",
    86: "Очікується повернення товару",
    87: "Виконано. Минув термін обробки",
    88: "Втрачена перевізником",
    89: "Повернення доставляється до розподільчого центру",
    90: "Повернення знаходиться у розподільчому центрі",
    91: "Доставляється у точку повернення"
};

const RozetkaStatusConverter = ({children, ...props}) => {
    const statusId = children
    const getStatus = (statusId) => {
        const status = statusMapping[statusId];

        if (!status) return 'Невідомий статус';

        // Jeśli długość opisu większa niż 17 znaków, dodaj "..."
        const shortStatus = status.length > 25 ? `${status.substring(0, 25)}...` : status;

        return shortStatus;
    };
    const status = statusMapping[statusId];
    const shortStatus = getStatus(statusId);

    return (
        <span title={status}>{shortStatus}</span>
    );
}
export default RozetkaStatusConverter;
